{
  "basics": {
    "name": "Xia (Summer) Wang",
    "label": "Researcher",
    "image": "",
    "email": "xia.wang@vanderbilt.edu",
    "phone": "(615) 892-2058",
    "location": {
      "address": "1025 16th Ave S",
      "postalCode": "TN 37212",
      "city": "Nashville",
      "countryCode": "US",
      "region": "Tennessee"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "xia-summer-wang",
        "url": "https://www.linkedin.com/in/xia-summer-wang/"
      }
    ]
  },
  "education": [
    {
      "institution": "Vanderbilt University",
      "location": "Nashville, US",
      "url": "https://www.vanderbilt.edu/",
      "area": "Computer Science",
      "studyType": "PhD",
      "startDate": "2022-08-15",
      "endDate": "2026-05-01",
      "score": "3.78/4.0"
    },
    {
      "institution": "Shanghai University of Finance and Economics",
      "location": "Shanghai, China",
      "url": "https://english.sufe.edu.cn/",
      "area": "Management Science and Engineering",
      "studyType": "Master",
      "startDate": "2013-09-01",
      "endDate": "2015-07-01",
      "score": "3.59/4.0"
    },
    {
      "institution": "Shanghai University of Finance and Economics",
      "location": "Shanghai, China",
      "url": "https://english.sufe.edu.cn/",
      "area": "Information System and Information Management",
      "studyType": "Bachelor",
      "startDate": "2008-09-01",
      "endDate": "2012-07-01",
      "score": "3.34/4.0"
    }
  ],
  "work": [
    {
      "name": "Institute for Software Integrated Systems, Vanderbilt University, Nashville, TN",
      "position": "Research assistant",
      "startDate": "2022-08-15",
      "endDate": "2026-05-01",
      "summary": "As a student researcher on the CIRCLES project, focused on developing integrative solutions for safe and reliable Cyber-Physical Systems in Autonomous Vehicles, leveraging deep learning, machine learning, data science, and formal methods, and participated in the 100 AI-powered cruise control cars experiment on Nashville's I24 in 2022."
    },
    {
      "name": "Biaoguo Technology, Chengdu, China",
      "position": "Business Counselor",
      "startDate": "2022-05-01",
      "endDate": "2022-07-01",
      "summary": "Analyzed business performance and provided strategic consulting to the Board, reconstructed the customer incentive marketing strategy leading to increased turnover and reduced violation expenses, and designed a sales assistant module that enhanced sales efficiency and effectiveness through data-driven insights."
    },
    {
      "name": "Full Truck Alliance, Shanghai, China",
      "position": "Algorithm Engineer",
      "startDate": "2021-03-01",
      "endDate": "2022-05-01",
      "summary": "Led a recommender system project using agile development, Java, Hive, Redis, and ES, achieving a 41% transaction rate and serving 1.38 million active drivers daily by monitoring operational indicators in real-time, analyzing driver behavior, and designing algorithms to optimize cargo recommendations."
    },
    {
      "name": "Lufax Holding Ltd., Shanghai, China",
      "position": "Internal Auditor",
      "startDate": "2017-11-01",
      "endDate": "2021-03-01",
      "summary": "Served five subsidiaries, including Pingan Puhui, Lufax, Qex, Cqfae, and Lu-Global, focusing on building internal risk control models, developing visual management interfaces, conducting IT audits, and inspecting high-risk matters, while collaborating cross-departmentally and externally, and developing a risk control visual dashboard that saved significant costs and was extended nationwide."
    },
    {
      "name": "Shanghai Pudong Development Bank, Shanghai, China",
      "position": "Project Manager",
      "startDate": "2015-11-01",
      "endDate": "2017-11-01",
      "summary": "Primary responsibilities include system implementation, software asset purchasing, outsourced personnel management, and new technology research, notably managing the core system implementation for the London Branch (2015-2017) and participating in the AI Innovation Project team."
    },
    {
      "name": "Microsoft, Shanghai, China",
      "position": "Cloud Consultant Intern",
      "startDate": "2014-11-01",
      "endDate": "2014-07-01",
      "summary": "Primary job responsibility contains pre-sales technical introduction of Azure cloud products to potential customers."
    },
    {
      "name": "ecSolutions Corporation Ltd., Shanghai, China",
      "position": "Software Engineer",
      "startDate": "2012-07-01",
      "endDate": "2013-04-01",
      "summary": "Primary job responsibility contains database mapping products and Basel iii internal disclosure system implementation for Agricultural Bank of China and Baotou Commercial Bank."
    }
  ],
  "projects": [
    {
      "name": "Interpretable Finite State Machine Controller: A Case Study on Lane Merge Yield Mode",
      "summary": "This work proposes a multi-mode Adaptive Cruise Control (ACC) system, incorporating a merge yield mode using a Finite State Machine (FSM), to enhance safety and comfort in traffic flow, validated through simulations and open-road testing.",
      "highlights": ["Adaptive Cruise Control", "Finite State Machine", "Simulation"],
      "startDate": "2024-03-01",
      "endDate": "2024-05-01"
    },
    {
      "name": "Improving Dynamic Wireless Charging System Performance For Electric Vehicles Through Variable Speed Limit Control Integration",
      "summary": "This paper proposes combining dynamic wireless charging with Variable Speed Limit (VSL) control to enhance Electric Vehicle (EV) charging efficiency and traffic safety, validated through microscopic traffic simulations showing improved charging system performance and smoother traffic flow.",
      "highlights": ["Dynamic Wireless Charging", "Variable Speed Limit", "Traffic Flow Optimization"],
      "startDate": "2024-04-01",
      "endDate": "2024-05-01"
    },
    {
      "name": "Reinforcement Learning with Communication Latency with Application to Stop-and-Go Wave Dissipation",
      "summary": "This work tests the influence of communication and processing latency on traffic wave dissipation control using Connected and Automated Vehicles (CAVs), demonstrating that reinforcement learning controllers maintain performance with latencies of 1 second or less, while non-reinforcement learning controllers rapidly deteriorate.",
      "highlights": ["Reinforcement Learning", "Communication Latency", "Stop-and-Go Wave Dissipation"],
      "startDate": "2024-01-01",
      "endDate": "2024-03-01"
    },
    {
      "name": "Runtime Monitoring of Accidents in Driving Recordings with Multi-type Logic in Empirical Models",
      "summary": "This work proposes a system to detect accidents in dashcam videos using vision-based algorithms, contextual abstraction, and runtime supervision, leveraging pre-trained models like YOLOv3 and DenseNet-201, and employing Higher Order Logic (HOL) and Signal Temporal Logic (STL) for improved anomaly detection.",
      "highlights": ["Anomaly detection", "Computer Vision", "Deep Learning"],
      "startDate": "2023-04-01",
      "endDate": "2023-06-01",
      "url": "https://link.springer.com/chapter/10.1007/978-3-031-44267-4_21"
    },
    {
      "name": "Robustness Verification for Knowledge-Based Logic of Risky Driving Scenes",
      "summary": "This project extracts human-understandable logic defining risky driving behaviors from large-scale public transportation accident datasets using tree-based models, and verified model robustness under various parameter combinations to assess resilience to perturbations.",
      "highlights": ["Robustness Verification", "Tree-based Models", "Risky Driving Logic"],
      "startDate": "2023-02-01",
      "endDate": "2023-05-01",
      "url": "https://arxiv.org/abs/2312.16364"
    },
    {
      "name": "Using Automated Vehicle Data as a Fitness Tracker for Sustainability",
      "summary": "This work leverages on-board vehicle data from advanced driver assistance systems to provide trip summaries that help drivers understand and improve their driving habits for better sustainability, similar to fitness tracking apps using smart devices, without requiring additional sensors.",
      "highlights": ["Advanced Driver Assistance Systems", "Sustainability", "On-board Vehicle Data"],
      "startDate": "2023-07-01",
      "endDate": "2023-09-01",
      "url": "https://ieeexplore.ieee.org/abstract/document/10485592"
    },
    {
      "name": "News Recommendation System",
      "summary": "This work utilizes a dataset of over 210,000 HuffPost news headlines (2012-2022), this project employed NLP methods for data preprocessing and implemented recommendation models, finding that collaborative filtering models (XGBRegressor and KNN) outperformed a content-based neural network model in MSE and RMSE metrics.",
      "highlights": ["News Recommendation", "NLP"],
      "startDate": "2023-03-01",
      "endDate": "2023-05-01",
      "url": "https://github.com/Summer72Wang/Evanhelion"
    },
    {
      "name": "Analyzing Fairness in Medical Image Representations",
      "summary": "This project proposes a novel solution to analyze unfairness in medical diagnosis using pre-trained deep learning algorithms (ResNet-18 and Visual Transformers), demonstrating that image representations contain sensitive information about patients' age and gender in the COVID-CT-MD and PAPILA datasets.",
      "highlights": ["Image Representations", "Fairness Analysis"],
      "startDate": "2022-10-01",
      "endDate": "2022-12-01",
      "url": "https://github.com/Summer72Wang/medFairness"
    },
    {
      "name": "CPS-VO and S&CC-VO Development and Management",
      "summary": "This project involves user cases design and function development for CPS-VO and S&CC-VO using UML and Drupal, and organizes virtual conferences by managing invited PIs, sending invitations, and tracking registration and attendance.",
      "highlights": ["UML", "Drupal", "Virtual Conference Organization"],
      "startDate": "2022-12-01",
      "endDate": "2024-08-01",
      "url": "https://cps-vo.org/"
    },
    {
      "name": "IPO Reports Analysis based on Text Data Mining",
      "summary": "This work deploys models to predict whether IPOs in China's A-share market would drop below their issue price immediately after issuance, using text and financial data from approximately 2,300 samples, achieving a classification accuracy of 95.83%.",
      "highlights": ["IPO Prediction", "NLP"],
      "startDate": "2013-11-01",
      "endDate": "2014-12-01"
    }
  ],
  "skills": [
    {
      "name": "ML & Statistic Analysis Skills",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "LLM",
        "NLP",
        "Computer Vision",
        "Deep Learning Models",
        "Machine Learning Models",
        "Time Series Models",
        "A/B Testing",
        "Data Visualization",
        "Database Management"
      ]
    },
    {
      "name": "Programming Languages",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Python",
        "SQL",
        "Java",
        "C++",
        "MATLAB",
        "R",
        "PHP",
        "HTML"
      ]
    }
  ],
  "languages": [
    {
      "language": "Mandarin",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ]
}
